2022.03.08.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2022.03.01.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2022.03.15.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of March 01 to 08, 2022.

#+TOC: headlines 1


* Ttweetnacl 0.1.0
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-ttweetnacl-0-1-0/9436/1

** Daniel Bünzli announced


It's my pleasure to announce the first release of ttweetnacl.

Ttweetnacl provides thin bindings to the [[https://tweetnacl.cr.yp.to/][TweetNaCl]] cryptographic library.

Ttweetnacl has no dependencies. The binding code is distributed under the ISC license and the integrated TweetNaCl C
code is in the public domain.

The binding has only been lightly used so far. Early adopters should pay special attention (or even better, review
the binding code  :–)

- Home page: https://erratique.ch/software/ttweetnacl
- Docs: https://erratique.ch/software/ttweetnacl/doc/  (or ~odig doc ttweetnacl~)
- Install: ~opam install ttweetnacl~ (once [[https://github.com/ocaml/opam-repository/pull/20828][this]] is merged)
      



* Dmap : type-safe dependent (heterogeneous) immutable maps
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ann-dmap-type-safe-dependent-heterogeneous-immutable-maps/9437/1

