2022.03.08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-08 Tue 11:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2022.03.01.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2022.03.15.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of March 01 to 08, 2022.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Ttweetnacl 0.1.0</a></li>
<li><a href="#2">Dmap : type-safe dependent (heterogeneous) immutable maps</a></li>
<li><a href="#3">bls12-381.3.0.0</a></li>
<li><a href="#4">Set up OCaml 2.0.0</a></li>
<li><a href="#5">Set up OCaml 2.0.1</a></li>
<li><a href="#6">Load Balancer on FPGA - a Hardcaml Project</a></li>
<li><a href="#7">Tutorial: Roguelike with effect handlers</a></li>
<li><a href="#8">Software Engineer Position at beNEXT.io</a></li>
<li><a href="#9">Sexp_decode: monadic decoders of S-expressions</a></li>
<li><a href="#10">Robur Reproducible Builds</a></li>
<li><a href="#11">OCaml compiler development newsletter, issue 5: November 2021 to February 2022</a></li>
<li><a href="#12">HACL* in OCaml: safe bindings for verified C code using Ctypes</a></li>
<li><a href="#13">OUPS meetup march 2022 (french only)</a></li>
<li><a href="#14">VSCode OCaml Platform 1.10.0</a></li>
<li><a href="#15">Other OCaml News</a></li>
<li><a href="#orge5d7f12">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">Ttweetnacl 0.1.0</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ttweetnacl-0-1-0/9436/1">https://discuss.ocaml.org/t/ann-ttweetnacl-0-1-0/9436/1</a>
</p>
</div>

<div id="outline-container-org518a158" class="outline-3">
<h3 id="org518a158">Daniel Bünzli announced</h3>
<div class="outline-text-3" id="text-org518a158">
<p>
It's my pleasure to announce the first release of ttweetnacl.
</p>

<p>
Ttweetnacl provides thin bindings to the <a href="https://tweetnacl.cr.yp.to/">TweetNaCl</a> cryptographic library.
</p>

<p>
Ttweetnacl has no dependencies. The binding code is distributed under the ISC license and the integrated TweetNaCl C
code is in the public domain.
</p>

<p>
The binding has only been lightly used so far. Early adopters should pay special attention (or even better, review
the binding code  :–)
</p>

<ul class="org-ul">
<li>Home page: <a href="https://erratique.ch/software/ttweetnacl">https://erratique.ch/software/ttweetnacl</a></li>
<li>Docs: <a href="https://erratique.ch/software/ttweetnacl/doc/">https://erratique.ch/software/ttweetnacl/doc/</a>  (or <code>odig doc ttweetnacl</code>)</li>
<li>Install: <code>opam install ttweetnacl</code> (once <a href="https://github.com/ocaml/opam-repository/pull/20828">this</a> is merged)</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Dmap : type-safe dependent (heterogeneous) immutable maps</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dmap-type-safe-dependent-heterogeneous-immutable-maps/9437/1">https://discuss.ocaml.org/t/ann-dmap-type-safe-dependent-heterogeneous-immutable-maps/9437/1</a>
</p>
</div>
