2022.03.08.html

<div id="outline-container-orgbf77bed" class="outline-3">
<h3 id="orgbf77bed">Benoit Montagu announced</h3>
<div class="outline-text-3" id="text-orgbf77bed">
<p>
It is my pleasure to announce the release of <code>Dmap</code>.
</p>

<p>
<code>Dmap</code> is an OCaml library that implements dependent (heterogeneous) immutable maps. The type of keys is indexed by
the type of the associated values, so that the maps can contain data whose types may depend on the values of keys. It
is adapted from the implementation code for maps that is used by the <a href="https://ocaml.org/">OCaml</a> standard library.
</p>

<p>
For instance:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">IntBool</span> = <span style="color: #000000; font-weight: bold;">struct</span>
  <span style="color: #b22222;">(* </span><span style="color: #b22222;">The type for the keys of our maps. The index ['a] denotes the type</span>
<span style="color: #b22222;">     of the values that will be associated to the keys. In the case of the</span>
<span style="color: #b22222;">     [Int] constructor, the map will expect data of type [string]. In the</span>
<span style="color: #b22222;">     case of the [Bool] constructor, the map will expect values of type [char].</span>
<span style="color: #b22222;">  </span><span style="color: #b22222;">*)</span>
  <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">'a t</span> = <span style="color: #000000; background-color: #ffffff;">Int</span> : int -&gt; string t | <span style="color: #000000; background-color: #ffffff;">Bool</span> : bool -&gt; char t

  <span style="color: #b22222;">(* </span><span style="color: #b22222;">Total order on values of type [_ t]. </span><span style="color: #b22222;">*)</span>
  <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #0000ff;">compare</span> (<span style="color: #a020f0;">type</span> <span style="color: #228b22;">a1</span> <span style="color: #228b22;">a2</span>) (<span style="color: #a0522d;">v1</span> :<span style="color: #228b22;"> a1 t</span>) (<span style="color: #a0522d;">v2</span> :<span style="color: #228b22;"> a2 t</span>) :<span style="color: #228b22;"> (a1, a2) cmp </span>=
    <span style="color: #a020f0;">match</span> (v1, v2) <span style="color: #a020f0;">with</span>
    | <span style="color: #000000; background-color: #ffffff;">Int</span> n1, <span style="color: #000000; background-color: #ffffff;">Int</span> n2 -&gt; <span style="color: #a020f0;">if</span> n1 = n2 <span style="color: #a020f0;">then</span> <span style="color: #000000; background-color: #ffffff;">Eq</span> <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> n1 &lt; n2 <span style="color: #a020f0;">then</span> <span style="color: #000000; background-color: #ffffff;">Lt</span> <span style="color: #a020f0;">else</span> <span style="color: #000000; background-color: #ffffff;">Gt</span>
    | <span style="color: #000000; background-color: #ffffff;">Bool</span> b1, <span style="color: #000000; background-color: #ffffff;">Bool</span> b2 -&gt;
        <span style="color: #a020f0;">if</span> b1 = b2 <span style="color: #a020f0;">then</span> <span style="color: #000000; background-color: #ffffff;">Eq</span> <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (<span style="color: #a52a2a;">not</span> b1) <span style="color: #a52a2a;">||</span> b2 <span style="color: #a020f0;">then</span> <span style="color: #000000; background-color: #ffffff;">Lt</span> <span style="color: #a020f0;">else</span> <span style="color: #000000; background-color: #ffffff;">Gt</span>
    | <span style="color: #000000; background-color: #ffffff;">Bool</span> _, <span style="color: #000000; background-color: #ffffff;">Int</span> _ -&gt; <span style="color: #000000; background-color: #ffffff;">Lt</span>
    | <span style="color: #000000; background-color: #ffffff;">Int</span> _, <span style="color: #000000; background-color: #ffffff;">Bool</span> _ -&gt; <span style="color: #000000; background-color: #ffffff;">Gt</span>
<span style="color: #000000; font-weight: bold;">end</span>

<span style="color: #b22222;">(* </span><span style="color: #b22222;">We create a module of maps whose keys have type [IntBool.t] </span><span style="color: #b22222;">*)</span>
<span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">IntBoolMap</span> = <span style="color: #228b22;">Dmap.Make(IntBool)</span>

<span style="color: #b22222;">(* </span><span style="color: #b22222;">Definition of a map of type [IntBoolMap.t]. </span><span style="color: #b22222;">*)</span>
<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">m</span> = <span style="color: #228b22;">IntBoolMap.</span>(empty <span style="color: #a52a2a;">|&gt;</span> add (<span style="color: #000000; background-color: #ffffff;">Int</span> 42) <span style="color: #8b2252;">"hello"</span> <span style="color: #a52a2a;">|&gt;</span> add (<span style="color: #000000; background-color: #ffffff;">Bool</span> <span style="color: #008b8b;">true</span>) <span style="color: #8b2252;">'A'</span>)

<span style="color: #b22222;">(* </span><span style="color: #b22222;">Some queries on the map [m] </span><span style="color: #b22222;">*)</span>
<span style="color: #000000; font-weight: bold;">let</span> () =
  <span style="color: #a020f0;">assert</span> (<span style="color: #228b22;">IntBoolMap.</span>find_opt (<span style="color: #000000; background-color: #ffffff;">Int</span> 42) m = <span style="color: #000000; background-color: #ffffff;">Some</span> <span style="color: #8b2252;">"hello"</span>);
  <span style="color: #a020f0;">assert</span> (<span style="color: #228b22;">IntBoolMap.</span>find_opt (<span style="color: #000000; background-color: #ffffff;">Bool</span> <span style="color: #008b8b;">true</span>) m = <span style="color: #000000; background-color: #ffffff;">Some</span> <span style="color: #8b2252;">'A'</span>);
  <span style="color: #a020f0;">assert</span> (<span style="color: #228b22;">IntBoolMap.</span>find_opt (<span style="color: #000000; background-color: #ffffff;">Bool</span> <span style="color: #008b8b;">false</span>) m = <span style="color: #000000; background-color: #ffffff;">None</span>)
</pre>
</div>

<p>
This creates a new module <code>IntBoolMap</code> , with a new type <code>IntBoolMap.t</code> of maps from <code>IntBool.t</code> to <code>string</code> or
<code>char</code> . As specified by the GADT definition of <code>IntBool.t</code> , the values associated to the keys of the form <code>Int n</code>
have type <code>string</code> , and the values associated to the keys of the form <code>Bool b</code> have type <code>char</code> .
</p>

<p>
You can install <code>Dmap</code> using opam by running <code>opam install dmap</code>
</p>

<p>
Repository: <a href="https://gitlab.inria.fr/bmontagu/dmap">https://gitlab.inria.fr/bmontagu/dmap</a>
</p>
</div>
</div>
