2022.03.08.org
** Hannes Mehnert asked and Benoit Montagu replied


#+begin_quote
thanks for your release announcement. Did you look into other similar libraries, and have a perspective how they are
different from dmap? What comes to my mind are [[https://erratique.ch/software/hmap][hmap]] and
[[https://github.com/hannesm/gmap][gmap]]. Are there other design goals, or different performance tradeoffs/guarantees?
#+end_quote

thanks for asking. Here are the differences with [[https://erratique.ch/software/hmap][hmap]] and
[[https://github.com/hannesm/gmap][gmap]], as far as I understand. Please correct me if I misunderstood some parts.

- [[https://erratique.ch/software/hmap][hmap]] only supports keys with no contents. In particular, no total ordering of keys is required. Instead, you can dynamically create new keys, with the type index that you want. It is fully type-safe (no ~assert false~, no ~Obj.magic~, etc). It does not support (but maybe it could) a polymorphic ~map~ function (this requires second-order polymorphism). It reuses the standard library's ~Map~ implementation by calling ~Map.Make~.
- [[https://github.com/hannesm/gmap][gmap]] supports keys with contents, and expects a total ordering function that returns a GADT to witness type equality, exactly as I did in [[https://gitlab.inria.fr/bmontagu/dmap][dmap]]. It supports a polymorphic ~map~ function (using second-order polymorphism). It reuses the standard library's ~Map~ implementation by calling ~Map.Make~. The implementation records the keys twice: as keys, and as part of the associated data, so that type equality witnesses can be exploited. This results in extra calls to the comparison functions on keys (see the code of ~get~ for an example). The extra calls and the double recording of keys might have an impact in terms of cost, that I cannot quantify. I should be measured. The code is /almost/ type-safe: it relies on the invariant the key is the same as the key part that is recorded as data for that that binding. The impossible cases returned by the comparison function are given the ~assert false~ behavior.
- [[https://gitlab.inria.fr/bmontagu/dmap][dmap]] also supports a polymorphic ~map~ function. It does not store keys twice: as in the standard library's implementation, the keys are stored only once. In comparison to [[https://github.com/hannesm/gmap][gmap]], the comparisons on keys are not done twice. The code is completely type-safe: no ~assert false~ is introduced to handle the impossible cases of key comparison. The implementation /duplicates/ the one of the standard library, rather than calling ~Map.Make~. The exported functions and their names are on par with the standard library's ~Map~.
      

** Daniel Bünzli then said


#+begin_quote
hmap…
It does not support (but maybe it could) a polymorphic ~map~ function (this requires second-order polymorphism).
#+end_quote

That reminds me of a PR I completely forgot about https://github.com/dbuenzli/hmap/pull/6
      



* bls12-381.3.0.0
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ann-bls12-381-3-0-0/9438/1

** Danny Willems announced


It is my pleasure to announce the release of the cryptographic library bls12-381.3.0.0 (keep reading for more details
about the library content and engineering problems we faced and solved).
The changelog from 2.0.1 can be found [[https://gitlab.com/dannywillems/ocaml-bls12-381/-/tags/3.0.0][here]].
The release is available in the public opam-repository. You can install it using
#+begin_src shell
opam install bls12-381.3.0.0
#+end_src

- Repository: https://gitlab.com/dannywillems/ocaml-bls12-381
- Release: https://gitlab.com/dannywillems/ocaml-bls12-381/-/tags/3.0.0
- License: [[https://gitlab.com/dannywillems/ocaml-bls12-381/-/blob/3.0.0/LICENSE][MIT]]
- Documentation: https://dannywillems.gitlab.io/ocaml-bls12-381/bls12-381/index.html
- Nomadic Labs website: https://nomadic-labs.com

This is also the first public announcement of a bls12-381 release. And, for this reason, I would like to describe the
history of the library and the different challenges we faced as it may interest OCaml engineers, and also describe
the content of bls12-381.

/Editor’s note: please find the rest of this long message at the archive link above./
      



* Set up OCaml 2.0.0
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0/9444/1

