2022.03.08.html


<div id="outline-container-orgdcb2335" class="outline-3">
<h3 id="orgdcb2335">Hannes Mehnert asked and Benoit Montagu replied</h3>
<div class="outline-text-3" id="text-orgdcb2335">
<blockquote>
<p>
thanks for your release announcement. Did you look into other similar libraries, and have a perspective how they are
different from dmap? What comes to my mind are <a href="https://erratique.ch/software/hmap">hmap</a> and
<a href="https://github.com/hannesm/gmap">gmap</a>. Are there other design goals, or different performance tradeoffs/guarantees?
</p>
</blockquote>

<p>
thanks for asking. Here are the differences with <a href="https://erratique.ch/software/hmap">hmap</a> and
<a href="https://github.com/hannesm/gmap">gmap</a>, as far as I understand. Please correct me if I misunderstood some parts.
</p>

<ul class="org-ul">
<li><a href="https://erratique.ch/software/hmap">hmap</a> only supports keys with no contents. In particular, no total ordering of keys is required. Instead, you can dynamically create new keys, with the type index that you want. It is fully type-safe (no <code>assert false</code>, no <code>Obj.magic</code>, etc). It does not support (but maybe it could) a polymorphic <code>map</code> function (this requires second-order polymorphism). It reuses the standard library's <code>Map</code> implementation by calling <code>Map.Make</code>.</li>
<li><a href="https://github.com/hannesm/gmap">gmap</a> supports keys with contents, and expects a total ordering function that returns a GADT to witness type equality, exactly as I did in <a href="https://gitlab.inria.fr/bmontagu/dmap">dmap</a>. It supports a polymorphic <code>map</code> function (using second-order polymorphism). It reuses the standard library's <code>Map</code> implementation by calling <code>Map.Make</code>. The implementation records the keys twice: as keys, and as part of the associated data, so that type equality witnesses can be exploited. This results in extra calls to the comparison functions on keys (see the code of <code>get</code> for an example). The extra calls and the double recording of keys might have an impact in terms of cost, that I cannot quantify. I should be measured. The code is <i>almost</i> type-safe: it relies on the invariant the key is the same as the key part that is recorded as data for that that binding. The impossible cases returned by the comparison function are given the <code>assert false</code> behavior.</li>
<li><a href="https://gitlab.inria.fr/bmontagu/dmap">dmap</a> also supports a polymorphic <code>map</code> function. It does not store keys twice: as in the standard library's implementation, the keys are stored only once. In comparison to <a href="https://github.com/hannesm/gmap">gmap</a>, the comparisons on keys are not done twice. The code is completely type-safe: no <code>assert false</code> is introduced to handle the impossible cases of key comparison. The implementation <i>duplicates</i> the one of the standard library, rather than calling <code>Map.Make</code>. The exported functions and their names are on par with the standard library's <code>Map</code>.</li>
</ul>
</div>
</div>


<div id="outline-container-orgf9d0715" class="outline-3">
<h3 id="orgf9d0715">Daniel Bünzli then said</h3>
<div class="outline-text-3" id="text-orgf9d0715">
<blockquote>
<p>
hmap…
It does not support (but maybe it could) a polymorphic <code>map</code> function (this requires second-order polymorphism).
</p>
</blockquote>

<p>
That reminds me of a PR I completely forgot about <a href="https://github.com/dbuenzli/hmap/pull/6">https://github.com/dbuenzli/hmap/pull/6</a>
</p>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">bls12-381.3.0.0</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-bls12-381-3-0-0/9438/1">https://discuss.ocaml.org/t/ann-bls12-381-3-0-0/9438/1</a>
</p>
</div>

<div id="outline-container-orgad35002" class="outline-3">
<h3 id="orgad35002">Danny Willems announced</h3>
<div class="outline-text-3" id="text-orgad35002">
<p>
It is my pleasure to announce the release of the cryptographic library bls12-381.3.0.0 (keep reading for more details
about the library content and engineering problems we faced and solved).
The changelog from 2.0.1 can be found <a href="https://gitlab.com/dannywillems/ocaml-bls12-381/-/tags/3.0.0">here</a>.
The release is available in the public opam-repository. You can install it using
</p>
<div class="org-src-container">
<pre class="src src-shell">opam install bls12-381.3.0.0
</pre>
</div>

<ul class="org-ul">
<li>Repository: <a href="https://gitlab.com/dannywillems/ocaml-bls12-381">https://gitlab.com/dannywillems/ocaml-bls12-381</a></li>
<li>Release: <a href="https://gitlab.com/dannywillems/ocaml-bls12-381/-/tags/3.0.0">https://gitlab.com/dannywillems/ocaml-bls12-381/-/tags/3.0.0</a></li>
<li>License: <a href="https://gitlab.com/dannywillems/ocaml-bls12-381/-/blob/3.0.0/LICENSE">MIT</a></li>
<li>Documentation: <a href="https://dannywillems.gitlab.io/ocaml-bls12-381/bls12-381/index.html">https://dannywillems.gitlab.io/ocaml-bls12-381/bls12-381/index.html</a></li>
<li>Nomadic Labs website: <a href="https://nomadic-labs.com">https://nomadic-labs.com</a></li>
</ul>

<p>
This is also the first public announcement of a bls12-381 release. And, for this reason, I would like to describe the
history of the library and the different challenges we faced as it may interest OCaml engineers, and also describe
the content of bls12-381.
</p>

<p>
<i>Editor’s note: please find the rest of this long message at the archive link above.</i>
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">Set up OCaml 2.0.0</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0/9444/1">https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0/9444/1</a>
</p>
</div>
