2022.03.08.html

<div id="outline-container-org3974363" class="outline-3">
<h3 id="org3974363">Sora Morimoto announced</h3>
<div class="outline-text-3" id="text-org3974363">
<p>
After a long time, it's time to officially release setup-ocaml v2!
With the official caching functionality introduced from v2, setup is much faster. (Notable thing: we've spent some
time with the GitHub team pulling Actions and the ecosystem itself to the level where it "actually works".)
We hope you will enjoy this release with a lot of other functionalities that we really need to do real development,
such as support for semver-style versioning (<code>ocaml-compiler: 4.13.x</code>).
And please report any bugs you encounter!
Thank you!
</p>

<p>
<i>Editor’s note: the full changelog is available at the archive link above.</i>
</p>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">Set up OCaml 2.0.1</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-1/9458/1">https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-1/9458/1</a>
</p>
</div>

<div id="outline-container-orge1eeb5b" class="outline-3">
<h3 id="orge1eeb5b">Sora Morimoto announced</h3>
<div class="outline-text-3" id="text-orge1eeb5b">
</div>
<div id="outline-container-org6b292cb" class="outline-4">
<h4 id="org6b292cb">Changed</h4>
<div class="outline-text-4" id="text-org6b292cb">
<ul class="org-ul">
<li>Update the package index if the system package installation fails.</li>
</ul>

<p>
<a href="https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.1">https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.1</a>
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">Load Balancer on FPGA - a Hardcaml Project</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/load-balancer-on-fpga-a-hardcaml-project/9447/1">https://discuss.ocaml.org/t/load-balancer-on-fpga-a-hardcaml-project/9447/1</a>
</p>
</div>

<div id="outline-container-orgdadecdf" class="outline-3">
<h3 id="orgdadecdf">Jakub Urbańczyk announced</h3>
<div class="outline-text-3" id="text-orgdadecdf">
<p>
My name is Jakub and I am a CS student. I would like to share with you a Hardcaml project that I have been working
for the past few months, which is a network load balancer. It has no practical usage, but I decided to publish it
because of (hopefully) educational value.
</p>

<p>
Link to the project: <a href="https://github.com/xThaid/fpga-lb">https://github.com/xThaid/fpga-lb</a>
</p>

<p>
When I was learning Hardcaml, the biggest barrier for me was the lack of existing projects. It would be extremely
useful to take a look at such a project to get to know some techniques, tricks, or how a big project should look like
in general. Therefore, I post this with hope that somebody will find it useful. Hardcaml seems to be a really
interesting alternative to other hardware description languages and I wish it had broader recognition.
</p>

<p>
Brief documentation of the architecture and more comments about the project are available in the repo.
</p>

<p>
Please let me know if you have any comments!
</p>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">Tutorial: Roguelike with effect handlers</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/tutorial-roguelike-with-effect-handlers/9422/6">https://discuss.ocaml.org/t/tutorial-roguelike-with-effect-handlers/9422/6</a>
</p>
</div>

<div id="outline-container-org06add17" class="outline-3">
<h3 id="org06add17">Continuing this thread, rand said</h3>
<div class="outline-text-3" id="text-org06add17">
<p>
Fun read with the rogue-like! - especially concerning your experiments with avoiding the gameloop via effects, as
I've been thinking about gameloopy stuff in the context of FRP.
</p>

<p>
I don't think the structure you propose scales very well concerning the complexity of extending the game semantics
over time, which you also stumbled over - but I guess that wasn't the intention.
</p>

<p>
A problem related to what you mentioned about updating other entities life, and having them update their state before
they are done sleeping - is that you would need to update your state after each resume of your continuation based on
what other entities communicated via the shared state. So in the end the code doesn't look as elegant, and becomes
more errorprone.
</p>

<p>
If others are interested in the "alternative gameloop" aspects - I implemented a simple browser-game with an
Elm-style gameloop using FRP in OCaml some years ago: <a href="https://github.com/rand00/flappy/blob/master/src/flap.ml#L29">https://github.com/rand00/flappy/blob/master/src/flap.ml#L29</a>
</p>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">Software Engineer Position at beNEXT.io</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/job-internship-software-engineer-position-at-benext-io/9451/1">https://discuss.ocaml.org/t/job-internship-software-engineer-position-at-benext-io/9451/1</a>
</p>
</div>
