2022.03.08.txt

  After a long time, it's time to officially release setup-ocaml v2!
  With the official caching functionality introduced from v2, setup is
  much faster. (Notable thing: we've spent some time with the GitHub
  team pulling Actions and the ecosystem itself to the level where it
  "actually works".)  We hope you will enjoy this release with a lot of
  other functionalities that we really need to do real development, such
  as support for semver-style versioning (`ocaml-compiler: 4.13.x').
  And please report any bugs you encounter!  Thank you!

  /Editor’s note: the full changelog is available at the archive link
  above./


Set up OCaml 2.0.1
══════════════════

  Archive: <https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-1/9458/1>


Sora Morimoto announced
───────────────────────

Changed
╌╌╌╌╌╌╌

  • Update the package index if the system package installation fails.

  <https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.1>


Load Balancer on FPGA - a Hardcaml Project
══════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/load-balancer-on-fpga-a-hardcaml-project/9447/1>


Jakub Urbańczyk announced
─────────────────────────

  My name is Jakub and I am a CS student. I would like to share with you
  a Hardcaml project that I have been working for the past few months,
  which is a network load balancer. It has no practical usage, but I
  decided to publish it because of (hopefully) educational value.

  Link to the project: [https://github.com/xThaid/fpga-lb]

  When I was learning Hardcaml, the biggest barrier for me was the lack
  of existing projects. It would be extremely useful to take a look at
  such a project to get to know some techniques, tricks, or how a big
  project should look like in general. Therefore, I post this with hope
  that somebody will find it useful. Hardcaml seems to be a really
  interesting alternative to other hardware description languages and I
  wish it had broader recognition.

  Brief documentation of the architecture and more comments about the
  project are available in the repo.

  Please let me know if you have any comments!


[https://github.com/xThaid/fpga-lb] <https://github.com/xThaid/fpga-lb>


Tutorial: Roguelike with effect handlers
════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/tutorial-roguelike-with-effect-handlers/9422/6>


Continuing this thread, rand said
─────────────────────────────────

  Fun read with the rogue-like! - especially concerning your experiments
  with avoiding the gameloop via effects, as I've been thinking about
  gameloopy stuff in the context of FRP.

  I don't think the structure you propose scales very well concerning
  the complexity of extending the game semantics over time, which you
  also stumbled over - but I guess that wasn't the intention.

  A problem related to what you mentioned about updating other entities
  life, and having them update their state before they are done sleeping
  - is that you would need to update your state after each resume of
  your continuation based on what other entities communicated via the
  shared state. So in the end the code doesn't look as elegant, and
  becomes more errorprone.

  If others are interested in the "alternative gameloop" aspects - I
  implemented a simple browser-game with an Elm-style gameloop using FRP
  in OCaml some years ago:
  <https://github.com/rand00/flappy/blob/master/src/flap.ml#L29>


Software Engineer Position at beNEXT.io
═══════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/job-internship-software-engineer-position-at-benext-io/9451/1>
