2022.03.08.html

<div id="outline-container-orgae85d33" class="outline-3">
<h3 id="orgae85d33">Martin Halford announced</h3>
<div class="outline-text-3" id="text-orgae85d33">
<p>
beNEXT, an Australian-based startup, is hiring for the <b>"Software Engineer"</b>.
</p>

<p>
beNEXT is creating the next generation of Smart Legal Contracts based on the Accord Project.
</p>

<p>
Our plan is to change the way contracts are negotiated and executed, and relegate paper and dumb PDFs to the recycle
bin of history, by turning contracts into discrete pieces of software that execute and interact with the real world!
</p>

<p>
You can learn more about beNEXT by visiting <a href="https://benext.io">https://benext.io</a> or the <b>Accord Project</b> by
visiting <a href="https://accordproject.org">https://accordproject.org</a>
</p>

<p>
beNEXT is looking for a highly motivated and intelligent individual with solid and demonstrable skills in one or more
of the following:
</p>

<ul class="org-ul">
<li>OCaml;</li>
<li>Q*cert compiler;</li>
<li>Coq;</li>
</ul>

<p>
Ideally this person would also have experience with Node.js and/or various Javascript frameworks.
</p>

<p>
An understanding of the <b>Accord Project</b> (including <b>Ergo</b>, <b>Concerto</b> and <b>Cicero</b>) would be advantageous
but not mandatory.
</p>

<p>
Candidates can be located anywhere in the world, provided they have access to reliable, high-speed internet and are
prepared to work hours which overlap with Australian Eastern Time - typically UTC+10:00.
</p>

<p>
If the successful candidate were lucky enough to live in Melbourne, Australia, then attending the <b>beNEXT office</b>
in Collingwood is an option. However, our assumption is that this engineer would work from their home office and/or a
local domestic office of their choosing.
</p>

<p>
We are open to engaging the successful candidate in either a <b>full-time, part-time or freelance role</b> depending on
the individual circumstances or preferences.
</p>

<p>
Alternatively, this could be an <b>internship role</b> for a final year computer science student with the view to
becoming a permanent employee upon graduation.
</p>

<p>
The successful candidate would primarily be working on contributions to the Accord Project, in addition to working on
the beNEXT <code>smartLEGAL</code> platform, as necessary.
</p>

<p>
Interested persons can contact us via email at <code>hello@benext.io</code> or by replying to this message.
</p>
</div>
</div>
</div>




<div id="outline-container-9" class="outline-2">
<h2 id="9">Sexp_decode: monadic decoders of S-expressions</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-sexp-decode-monadic-decoders-of-s-expressions/9455/1">https://discuss.ocaml.org/t/ann-sexp-decode-monadic-decoders-of-s-expressions/9455/1</a>
</p>
</div>

<div id="outline-container-org99d39f5" class="outline-3">
<h3 id="org99d39f5">Benoit Montagu announced</h3>
<div class="outline-text-3" id="text-org99d39f5">
<p>
It is my pleasure to release the <code>Sexp_decode</code> library.
</p>

<p>
<code>Sexp_decode</code> is a library of monadic combinators for decoding S-expressions (as defined in the <a href="https://github.com/ocaml-dune/csexp">Csexp
library</a>) into structured data. S-expressions are a simple serialisation format
for data exchange, that is (in particular) used in <code>dune</code>. Decoders are a form of parsers for S-expressions.
</p>

<p>
Repository: <a href="https://gitlab.inria.fr/bmontagu/sexp_decode">https://gitlab.inria.fr/bmontagu/sexp_decode</a>
</p>

<p>
<code>Sexp_decode</code> is available on <code>opam</code>.
You can install it by typing <code>opam install sexp_decode</code>
</p>
</div>
