2022.03.08.txt


Martin Halford announced
────────────────────────

  beNEXT, an Australian-based startup, is hiring for the *"Software
  Engineer"*.

  beNEXT is creating the next generation of Smart Legal Contracts based
  on the Accord Project.

  Our plan is to change the way contracts are negotiated and executed,
  and relegate paper and dumb PDFs to the recycle bin of history, by
  turning contracts into discrete pieces of software that execute and
  interact with the real world!

  You can learn more about beNEXT by visiting [https://benext.io] or the
  *Accord Project* by visiting [https://accordproject.org]

  beNEXT is looking for a highly motivated and intelligent individual
  with solid and demonstrable skills in one or more of the following:

  • OCaml;
  • Q*cert compiler;
  • Coq;

  Ideally this person would also have experience with Node.js and/or
  various Javascript frameworks.

  An understanding of the *Accord Project* (including *Ergo*, *Concerto*
  and *Cicero*) would be advantageous but not mandatory.

  Candidates can be located anywhere in the world, provided they have
  access to reliable, high-speed internet and are prepared to work hours
  which overlap with Australian Eastern Time - typically UTC+10:00.

  If the successful candidate were lucky enough to live in Melbourne,
  Australia, then attending the *beNEXT office* in Collingwood is an
  option. However, our assumption is that this engineer would work from
  their home office and/or a local domestic office of their choosing.

  We are open to engaging the successful candidate in either a
  *full-time, part-time or freelance role* depending on the individual
  circumstances or preferences.

  Alternatively, this could be an *internship role* for a final year
  computer science student with the view to becoming a permanent
  employee upon graduation.

  The successful candidate would primarily be working on contributions
  to the Accord Project, in addition to working on the beNEXT
  `smartLEGAL' platform, as necessary.

  Interested persons can contact us via email at `hello@benext.io' or by
  replying to this message.


[https://benext.io] <https://benext.io>

[https://accordproject.org] <https://accordproject.org>


Sexp_decode: monadic decoders of S-expressions
══════════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ann-sexp-decode-monadic-decoders-of-s-expressions/9455/1>


Benoit Montagu announced
────────────────────────

  It is my pleasure to release the `Sexp_decode' library.

  `Sexp_decode' is a library of monadic combinators for decoding
  S-expressions (as defined in the [Csexp library]) into structured
  data. S-expressions are a simple serialisation format for data
  exchange, that is (in particular) used in `dune'. Decoders are a form
  of parsers for S-expressions.

  Repository: <https://gitlab.inria.fr/bmontagu/sexp_decode>

  `Sexp_decode' is available on `opam'.  You can install it by typing
  `opam install sexp_decode'


[Csexp library] <https://github.com/ocaml-dune/csexp>

Example
╌╌╌╌╌╌╌
