2022.03.08.html

<div id="outline-container-orga16b70b" class="outline-4">
<h4 id="orga16b70b">Example</h4>
<div class="outline-text-4" id="text-orga16b70b">
<p>
The purpose of the library is to help the translation of S-expressions into structured data.
</p>

<p>
For example, you may want to transform an address book encoded as an S-expression into structured data, that is
easier to process.
</p>

<p>
Let's assume your address book looks like the following:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">open </span><span style="color: #228b22;">Sexp_decode</span>

<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">address_book</span> :<span style="color: #228b22;"> sexp </span>=
<span style="color: #000000; background-color: #ffffff;">List</span>
  [
    <span style="color: #000000; background-color: #ffffff;">List</span>
      [
        <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"entry"</span>;
        <span style="color: #000000; background-color: #ffffff;">List</span> [ <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"name"</span>; <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"John Doe"</span> ];
        <span style="color: #000000; background-color: #ffffff;">List</span> [ <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"country"</span>; <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"New Zealand"</span> ];
      ];
    <span style="color: #000000; background-color: #ffffff;">List</span>
      [
        <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"entry"</span>;
        <span style="color: #000000; background-color: #ffffff;">List</span> [ <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"name"</span>; <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"Mary Poppins"</span> ];
        <span style="color: #000000; background-color: #ffffff;">List</span> [ <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"email"</span>; <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"umbrella@imaginary-domain.uk"</span> ];
      ];
    <span style="color: #000000; background-color: #ffffff;">List</span>
      [
        <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"entry"</span>;
        <span style="color: #000000; background-color: #ffffff;">List</span> [ <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"name"</span>; <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"Groot"</span> ];
        <span style="color: #000000; background-color: #ffffff;">List</span> [ <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"country"</span>; <span style="color: #000000; background-color: #ffffff;">Atom</span> <span style="color: #8b2252;">"Groot"</span> ];
      ];
  ]
</pre>
</div>

<p>
A representation as an OCaml value that is probably easier to work with, is by using the following <code>entry</code> type:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">entry</span> =
  { name : string; country : string option; email : string option }

<span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">address_book</span> = entry list
</pre>
</div>

<p>
It is easy to define decoders that produce values of types <code>entry</code> and <code>address_book</code> :
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">entry_decoder</span> :<span style="color: #228b22;"> entry decoder </span>=
field <span style="color: #8b2252;">"entry"</span>
<span style="color: #a52a2a;">@@</span> <span style="color: #000000; font-weight: bold;">let*</span> <span style="color: #a0522d;">name</span> = field <span style="color: #8b2252;">"name"</span> atom <span style="color: #000000; font-weight: bold;">in</span>
   <span style="color: #000000; font-weight: bold;">let*</span> <span style="color: #a0522d;">country</span> = maybe <span style="color: #a52a2a;">@@</span> field <span style="color: #8b2252;">"country"</span> atom <span style="color: #000000; font-weight: bold;">in</span>
   <span style="color: #000000; font-weight: bold;">let+</span> <span style="color: #a0522d;">email</span> = maybe <span style="color: #a52a2a;">@@</span> field <span style="color: #8b2252;">"email"</span> atom <span style="color: #000000; font-weight: bold;">in</span>
   { name; country; email }

<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">address_book_decoder</span> :<span style="color: #228b22;"> address_book decoder </span>= list entry_decoder
</pre>
</div>

<p>
Then, you can execute the <code>run</code> function, that has type <code>'a decoder -&gt; sexp -&gt; 'a option</code> . It produces the following
result on our <code>address_book</code> example:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">result</span> = run address_book_decoder address_book
<span style="color: #b22222;">(* </span><span style="color: #b22222;">result =</span>
<span style="color: #b22222;">     Some</span>
<span style="color: #b22222;">      [{name = "John Doe"; country = Some "New Zealand"; email = None};</span>
<span style="color: #b22222;">       {name = "Mary Poppins"; country = None;</span>
<span style="color: #b22222;">        email = Some "umbrella@imaginary-domain.uk"};</span>
<span style="color: #b22222;">       {name = "Groot"; country = Some "Groot"; email = None}]</span>
<span style="color: #b22222;">*)</span>
</pre>
</div>

<p>
In addition to the <code>field</code> , <code>maybe</code> , <code>atom</code> and <code>list</code> decoders, the <code>Sexp_decode</code> library provides combinators to
build compound decoders from basic ones, and compose them together. In particular, decoders for variants and records
are provided.
</p>

<p>
For example, with the <code>fields</code> combinator, you could define <code>entry_decoder</code> as follows:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">entry_decoder_alt</span> :<span style="color: #228b22;"> entry decoder </span>=
  field <span style="color: #8b2252;">"entry"</span>
  <span style="color: #a52a2a;">@@</span> fields
       <span style="color: #008b8b;">~default</span>:{ name = <span style="color: #8b2252;">""</span>; country = <span style="color: #000000; background-color: #ffffff;">None</span>; email = <span style="color: #000000; background-color: #ffffff;">None</span> }
       [
         (<span style="color: #8b2252;">"name"</span>, atom &gt;&gt;| <span style="color: #a020f0;">fun</span> <span style="color: #a0522d;">name</span> <span style="color: #a0522d;">entry</span> -&gt; { entry <span style="color: #a020f0;">with</span> name });
         ( <span style="color: #8b2252;">"country"</span>, atom &gt;&gt;| <span style="color: #a020f0;">fun</span> <span style="color: #a0522d;">country</span> <span style="color: #a0522d;">entry</span> -&gt; { entry <span style="color: #a020f0;">with</span> country = <span style="color: #000000; background-color: #ffffff;">Some</span> country });
         (<span style="color: #8b2252;">"email"</span>, atom &gt;&gt;| <span style="color: #a020f0;">fun</span> <span style="color: #a0522d;">email</span> <span style="color: #a0522d;">entry</span> -&gt; { entry <span style="color: #a020f0;">with</span> email = <span style="color: #000000; background-color: #ffffff;">Some</span> email });
       ]
</pre>
</div>

<p>
With this alternative decoder for entries, the fields <code>"name"</code> <code>"country"</code> and <code>"email"</code> might occur in any order,
and any number of times.
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-10" class="outline-2">
<h2 id="10">Robur Reproducible Builds</h2>
<div class="outline-text-2" id="text-10">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-robur-reproducible-builds/8827/2">https://discuss.ocaml.org/t/ann-robur-reproducible-builds/8827/2</a>
</p>
</div>
