2022.03.08.txt


Hannes Mehnert announced
────────────────────────

  We (@rand @reynir @hannes) have several updates in this project:
  • binary package repositories (debian, ubuntu, FreeBSD) are now
    available with monotonic version numbering
  • the <https://builds.robur.coop> website has an updated look and
    feel, and includes dependency visualizations and "which module uses
    how much space" visualizations (a treemap, based on @Drup
    modulectomy)

  Instructions on how to get started to setup unikernels at
  <https://robur.coop/Projects/Reproducible_builds>


OCaml compiler development newsletter, issue 5: November 2021 to February 2022
══════════════════════════════════════════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-5-november-2021-to-february-2022/9459/1>


gasche announced
────────────────

  I’m happy to publish the fifth issue of the “OCaml compiler
  development newsletter”. You can find all issues using the tag
  [compiler-newsletter].

  Note: the content of the newsletter is by no means exhaustive, only a
  few of the compiler maintainers and contributor had the time to write
  something, which is perfectly fine.

  Feel free of course to comment or ask questions!

  If you have been working on the OCaml compiler and want to say
  something, please feel free to post in this thread! If you would like
  me to get in touch next time I prepare a newsletter issue (some random
  point in the future), please let me know by Discuss message or by
  email at (gabriel.scherer at gmail).


[compiler-newsletter]
<https://discuss.ocaml.org/tag/compiler-newsletter>

Context
╌╌╌╌╌╌╌

  The [last issue (October 2021)] corresponded to the last development
  period before merging the Multicore OCaml implementation and the
  "Sequential freeze" (a freeze on non-multicore-related changes to
  facilitate the Multicore merge).

  Since then there has of course been a massive amount of work by the
  Multicore team (see the massive [Multicore newsletter for January
  2022]).  The upstream development pace has been unusual: there is less
  non-multicore activity than before (last-minute changes for the 4.14
  release, and long-running projects moving on in parallel), there is a
  fair amount of work cleaning up things that were broken by the
  Multicore merge, with an influx of new contributors and also some
  non-new contributors which are still complete beginners with respect
  to the Multicore runtime.

  Things are moving along at a reasonable pace, and we expect to release
  5.0 at some point :-)


[last issue (October 2021)]
<https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-4-october-2021/8833>

[Multicore newsletter for January 2022]
<https://discuss.ocaml.org/t/multicore-ocaml-january-2022-and-post-merge-activity/9294>


Individual reports
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

@gasche Gabriel Scherer
┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄

Shapes
┈┈┈┈┈┈

  In #[10718], @voodoos Ulysse Gérard, @trefis Thomas Refis and @lpw25
  Leo White proposed "shapes", a new form of static information about
  OCaml modules that would be computed and stored by the OCaml compiler
  to help other tools, in particular Merlin, work with OCaml
  names/definitions. (This is entirely their work, not mine!) The work
  was merged in the 4.14 development version.

  After the merge, opam-wide testing by @kit-ty-kate Kate Deplaix
  revealed performance issues on some functor-heavy code, in particular
  Irmin. Shape computation in the compiler would blow up, in computation
  time and/or size of the generated build artifacts.

  The core mechanism of "shapes" is an evaluator for lambda-terms. In
  #[10825] I worked on a more efficient evaluator (with help from
  @Edkohibs Nathanaëlle Courant), using relatively advanced machinery
  (strong call-by-need reduction), and it gives good results in practice
  – there are no known cases of time or size blowup anymore. There was a
  lot of back-and-forth between different design and implementation
  choices, and additional testing by Ulysse helped a lot!  Finally we
  had an in-person review meeting with Ulysse, Thomas, @Octachron
  Florian Angeletti and Nathanaëlle, and it was a lot of fun, especially
  in these times of low in-person activity.


[10718] <https://github.com/ocaml/ocaml/issues/10718>

[10825] <https://github.com/ocaml/ocaml/issues/10825>
