2022.03.08.org
***** GADT and pattern generalization

In #[[https://github.com/ocaml/ocaml/issues/1097][1097]], @dongyan reported a soundness bug in the OCaml type-checker
due to the interaction of polymorhpism (generalisation) and GADT existential types in the type inference of
pattern-matching. We analyzed the issue and I proposed a restriction of the typing rule to reject unsound examples;
@lpw25 Leo White refined the proposal further. I tried to implement the fix/restriction myself, but it's not easy
when one is not familiar with the OCaml codebase. Jacques Garrigue proposed a full implementation in
#[[https://github.com/ocaml/ocaml/issues/10907][10907]], which is now merged. (This implements only my initial
criterion, not Leo's refinement, which is harder to implement within the current type inference implementation for
patterns.)

***** Beginner-level Multicore hacking

These days, OCaml maintainers are gently encouraged into working on the Multicore-related post-merge tasks, instead
of slacking off working on cool optimisations or type system bugs. (The two tasks above have the excuse that they
helped preparing the 4.14 release.) But most people knew nothing about the Multicore runtime until a few months ago,
so everyone is a beginner here!

I worked on small refactoring or minor bugfixes as I spotted them reading the code, with three larger pieces:

1. #[[https://github.com/ocaml/ocaml/issues/10887][10887]]: I kept working with @xavierleroy on the Domain.DLS interface to let OCaml libraries store per-domain global state; now it's possible to create per-domain state that is "inherited" on Domain.spawn (the child state is computed from the parent state). This was a necessary building block to replace the Random implementation by a splittable random number generator, which was finally done in #[[https://github.com/ocaml/ocaml/issues/10742][10742]] by Xavier using LXM as planned.

2. #[[https://github.com/ocaml/ocaml/issues/10971][10971]]: this issue by @sabine Sabine Schmaltz is discussing how to change the size of the reserved memory address space used for minor heaps, when the user asks for larger minor heaps or for more domains. (Each domain has its own minor heap, but they are contiguous for fast `Is_young` checking.) Sabine and I are working on an implementation. I sent various preparation PRs such as #[[https://github.com/ocaml/ocaml/issues/10974][10974]] (changing the mechanism to compute unique domain identifiers, which relied on a fixed Max_domains limit).

3. gc stats (#[[https://github.com/ocaml/ocaml/issues/11008][11008]], #[[https://github.com/ocaml/ocaml/issues/11047][11047]]): the code to compute GC statistics needs some love, it changed significantly in the Multicore runtime but is also trying to preserve the interface exposed by the previous GC, and some things are slightly wrong. I started reading the code from the Max_domains angle (it is storing per-domain statistics in a fixed-sized array), but ended up working on it with help from @Engil Enguerrand Decorne.

**** @xavierleroy Xavier Leroy

On January 10th 2022, I had the privilege to push the "merge" button on pull request
#[[https://github.com/ocaml/ocaml/issues/10831][10831]], thus bringing Multicore OCaml into the OCaml "trunk" and
giving birth to OCaml 5.

Before and after this glorious moment, the Multicore OCaml development team, the other reviewers and I have been
spending considerable amounts of time studying and reviewing the Multicore OCaml sources, reviewing the big pull
request, and fixing the issues that remain after the merge.  I also spent much time reworking our Jenkins CI system
to handle OCaml 5 and adapting the test suite accordingly.

The transition to OCaml 5 is also a great opportunity to remove long-obsolete features and simplify the code base.
For example, in #[[https://github.com/ocaml/ocaml/issues/10898][10898]], I was able to remove a lot of cruft for signal
handling that is no longer relevant now that signal handlers no longer run immediately on receiving the signal and
stack overflow is explicitly managed by ocamlopt-generated code.  Another example is
#[[https://github.com/ocaml/ocaml/issues/10935][10935]], which deprecates the ~Thread.exit~ function and offers a
simpler, exception-based mechanism for early thread termination.

Last but not least, I was finally able to merge my reimplementation of the Random module on top of the lovely LXM
pseudo-random number generator (#[[https://github.com/ocaml/ocaml/issues/10742][10742]]), thanks to @gasche's work on
domain-local state.

**** @Octachron Florian Angeletti

