2022.03.08.html

<div id="outline-container-orge134ca0" class="outline-5">
<h5 id="orge134ca0">@Octachron Florian Angeletti</h5>
<div class="outline-text-5" id="text-orge134ca0">
</div>
<div id="outline-container-orgfca9643" class="outline-6">
<h6 id="orgfca9643">Benchmarking compilation time and compilation artefact size for shapes</h6>
<div class="outline-text-6" id="text-orgfca9643">
<p>
As described by @gasche, OCaml 4.14 introduces a new kind of metadata called <code>shape</code>. The computation of shapes
metadata has some cost in term of compilation time. During the initial review, I had completely underestimated that
cost, which lead to the compilation time blow up reported by irmin. When it was time to fix that mistake, I wanted to
have a more global view of the effect of the shape computation on a significant slice of the opam repository.
Thus I measured both the compilation time and the size of compilation artefacts with and without the shape
computation for over a thousand of opam packages (the half of the opam repository with the most reverse
dependencies).
Fortunately, this performance measurement campaign concluded that for 90% of source files, the increase of
compilation time was less than 10%:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">percentile</th>
<th scope="col" class="org-right">relative compilation time increase</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1%</td>
<td class="org-right">-9%</td>
</tr>

<tr>
<td class="org-right">10%</td>
<td class="org-right">0%</td>
</tr>

<tr>
<td class="org-right">25%</td>
<td class="org-right">0%</td>
</tr>

<tr>
<td class="org-right">50%</td>
<td class="org-right">0%</td>
</tr>

<tr>
<td class="org-right">75%</td>
<td class="org-right">+4%</td>
</tr>

<tr>
<td class="org-right">90%</td>
<td class="org-right">+10%</td>
</tr>

<tr>
<td class="org-right">99%</td>
<td class="org-right">+20%</td>
</tr>

<tr>
<td class="org-right">99.9%</td>
<td class="org-right">+32%</td>
</tr>

<tr>
<td class="org-right">99.99%</td>
<td class="org-right">+46%</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga0bcca0" class="outline-6">
<h6 id="orga0bcca0">Documentation tags for a new era</h6>
<div class="outline-text-6" id="text-orga0bcca0">
<p>
With Multicore OCaml, OCaml libraries will need to document how safe they are to use in a multicore context, in
particular if they use some global state. To make it as easy as possible to document that point, I have started to
implement new ocamldoc tags for multicore safety in  #<a href="https://github.com/ocaml/ocaml/issues/10983">10983</a> . However,
the developers of odoc weren't keen on the idea of adding more tags, and proposed that this information should be
conveyed in attributes that could be lifted to the documentation. @julow Jules Aguillon proposed an implementation in
#<a href="https://github.com/ocaml/ocaml/issues/11024">11024</a>, that I have reviewed. This change by itself improves the state
of alert in the documentation which is already a great improvement and should allow us to reach better design for
multicore-safety documentation later on.
</p>
</div>
</div>

<div id="outline-container-org04e9376" class="outline-6">
<h6 id="org04e9376">Beginner-level multicore hacking</h6>
<div class="outline-text-6" id="text-org04e9376">
<p>
To participate a little to the stabilisation of OCaml 5.0, I spend some time to make the <code>Dynlink</code> library
thread-safe in the easiest way: by a adding a global lock to the library. This is one of the few cases where a adding
global lock to an existing library makes sense since we simultaneously don't expect call to <code>Dynlink</code> function to be
performance critical and really don't want race condition in <code>Dynlink</code> to corrupt the state of the whole program.
</p>
</div>
</div>
</div>

<div id="outline-container-org4be68e5" class="outline-5">
<h5 id="org4be68e5">@garrigue Jacques Garrigue</h5>
<div class="outline-text-5" id="text-org4be68e5">
</div>
<div id="outline-container-org2c5244c" class="outline-6">
<h6 id="org2c5244c">Cleaning up variance computation</h6>
<div class="outline-text-6" id="text-org2c5244c">
<p>
For many, the computation of variances in type definitions is quite mysterious. The only available specification is a
short abstract at the OCaml Meeting 2013, and it is actually incomplete. With Takafumi Saikawa, I took a fresh look
at the problem and we came up with a clearer lattice, and more explicit algorithms. This is still a draft PR
#<a href="https://github.com/ocaml/ocaml/issues/11018">11018</a>.
</p>
</div>
</div>

<div id="outline-container-org21b6313" class="outline-6">
<h6 id="org21b6313">Separate typing of counter-examples from <code>type_pat</code></h6>
<div class="outline-text-6" id="text-org21b6313">
<p>
Since the introduction of GADTs, <code>type_pat</code>, the function that types patterns, is also used to discard impossible
cases during the exhaustiveness check. Moreover, it was later turned into continuation-passing style to allow
backtracking, in order to check type inhabitation. Originally this seemed a good idea, allowing to factorize much
code, but then new functionality was added to <code>type_pat</code>, and the two roles started to diverge.
#<a href="https://github.com/ocaml/ocaml/issues/11027">11027</a> is another draft PR that separates them, reverting <code>type_pat</code>
to direct style, and adding a new <code>retype_pat</code> function which takes as input a partially typed tree. Interestingly,
this de-factorization actually reduces the code size by more than a hundred lines.
</p>
</div>
</div>

<div id="outline-container-orgd811ecc" class="outline-6">
<h6 id="orgd811ecc">Coqgen</h6>
<div class="outline-text-6" id="text-orgd811ecc">
<p>
The experimental Gallina generating backend is still progressing albeit slowly.
For those intrested there are now slides describing it.
<a href="http://www.math.nagoya-u.ac.jp/~garrigue/papers/coqgen-slides-tpp2021.pdf">http://www.math.nagoya-u.ac.jp/~garrigue/papers/coqgen-slides-tpp2021.pdf</a>
</p>
</div>
</div>
</div>
