2022.03.08.txt

Benchmarking compilation time and compilation artefact size for shapes
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈

  As described by @gasche, OCaml 4.14 introduces a new kind of metadata
  called `shape'. The computation of shapes metadata has some cost in
  term of compilation time. During the initial review, I had completely
  underestimated that cost, which lead to the compilation time blow up
  reported by irmin. When it was time to fix that mistake, I wanted to
  have a more global view of the effect of the shape computation on a
  significant slice of the opam repository.  Thus I measured both the
  compilation time and the size of compilation artefacts with and
  without the shape computation for over a thousand of opam packages
  (the half of the opam repository with the most reverse dependencies).
  Fortunately, this performance measurement campaign concluded that for
  90% of source files, the increase of compilation time was less than
  10%:

  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
   percentile  relative compilation time increase 
  ────────────────────────────────────────────────
           1%                                 -9% 
          10%                                  0% 
          25%                                  0% 
          50%                                  0% 
          75%                                 +4% 
          90%                                +10% 
          99%                                +20% 
        99.9%                                +32% 
       99.99%                                +46% 
  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━


Documentation tags for a new era
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈

  With Multicore OCaml, OCaml libraries will need to document how safe
  they are to use in a multicore context, in particular if they use some
  global state. To make it as easy as possible to document that point, I
  have started to implement new ocamldoc tags for multicore safety in
  #[10983] . However, the developers of odoc weren't keen on the idea of
  adding more tags, and proposed that this information should be
  conveyed in attributes that could be lifted to the
  documentation. @julow Jules Aguillon proposed an implementation in
  #[11024], that I have reviewed. This change by itself improves the
  state of alert in the documentation which is already a great
  improvement and should allow us to reach better design for
  multicore-safety documentation later on.


[10983] <https://github.com/ocaml/ocaml/issues/10983>

[11024] <https://github.com/ocaml/ocaml/issues/11024>


Beginner-level multicore hacking
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈

  To participate a little to the stabilisation of OCaml 5.0, I spend
  some time to make the `Dynlink' library thread-safe in the easiest
  way: by a adding a global lock to the library. This is one of the few
  cases where a adding global lock to an existing library makes sense
  since we simultaneously don't expect call to `Dynlink' function to be
  performance critical and really don't want race condition in `Dynlink'
  to corrupt the state of the whole program.


@garrigue Jacques Garrigue
┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄

Cleaning up variance computation
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈

  For many, the computation of variances in type definitions is quite
  mysterious. The only available specification is a short abstract at
  the OCaml Meeting 2013, and it is actually incomplete. With Takafumi
  Saikawa, I took a fresh look at the problem and we came up with a
  clearer lattice, and more explicit algorithms. This is still a draft
  PR #[11018].


[11018] <https://github.com/ocaml/ocaml/issues/11018>


Separate typing of counter-examples from `type_pat'
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈

  Since the introduction of GADTs, `type_pat', the function that types
  patterns, is also used to discard impossible cases during the
  exhaustiveness check. Moreover, it was later turned into
  continuation-passing style to allow backtracking, in order to check
  type inhabitation. Originally this seemed a good idea, allowing to
  factorize much code, but then new functionality was added to
  `type_pat', and the two roles started to diverge.  #[11027] is another
  draft PR that separates them, reverting `type_pat' to direct style,
  and adding a new `retype_pat' function which takes as input a
  partially typed tree. Interestingly, this de-factorization actually
  reduces the code size by more than a hundred lines.


[11027] <https://github.com/ocaml/ocaml/issues/11027>


Coqgen
┈┈┈┈┈┈

  The experimental Gallina generating backend is still progressing
  albeit slowly.  For those intrested there are now slides describing
  it.
  <http://www.math.nagoya-u.ac.jp/~garrigue/papers/coqgen-slides-tpp2021.pdf>
