2022.03.08.html

<div id="outline-container-orgc340a8b" class="outline-5">
<h5 id="orgc340a8b">@nojb Nicolas Ojeda Bär</h5>
<div class="outline-text-5" id="text-orgc340a8b">
<p>
We are taking advantage of the 5.0 release to get rid of a lot of cruft that had built up over time:
</p>
<ul class="org-ul">
<li>#<a href="https://github.com/ocaml/ocaml/issues/10897">10897</a>: Remove everything officially marked as deprecated before the 5.0 release.</li>
<li>#<a href="https://github.com/ocaml/ocaml/issues/10863">10863</a>: Remove the <code>&lt;caml/compatibiliy.h&gt;</code> header which contained the definition of some runtime symbols without the <code>caml_</code> prefix for compatibility.</li>
<li>#<a href="https://github.com/ocaml/ocaml/issues/10896">10896</a>: Remove <code>Stream</code>, <code>Genlex</code> and <code>Pervasives</code> from the standard library, as well as the <b>standalone</b> <code>bigarray</code> library (no longer needed since the <code>Bigarray</code> module was moved into the standard library).</li>
<li>#<a href="https://github.com/ocaml/ocaml/issues/11002">11002</a>: No longer use the <code>Begin_roots~/~End_roots</code> macros in the runtime system. These were not yet removed because they are used by some external projects (eg <a href="https://github.com/xavierleroy/camlidl"><code>camlidl</code></a>).</li>
<li>#<a href="https://github.com/ocaml/ocaml/issues/10922">10922</a>, #<a href="https://github.com/ocaml/ocaml/issues/10923">10923</a>: Add deprecation attributes to some symbols that did not have them so that we can remove them in some future release.</li>
</ul>

<p>
Apart from all this spring cleaning, a small addition to the standard library that I had missed for a long time:
</p>

<ul class="org-ul">
<li>#<a href="https://github.com/ocaml/ocaml/issues/10986">10986</a>: Add <code>Scanf.scanf_opt</code>, <code>Scanf.sscanf_opt</code> and <code>Scanf.bscanf_opt</code> option-returning variants.</li>
</ul>
</div>
</div>

<div id="outline-container-org5bcd204" class="outline-5">
<h5 id="org5bcd204">@dra27 David Allsopp</h5>
<div class="outline-text-5" id="text-org5bcd204">
</div>
<div id="outline-container-org5632d8f" class="outline-6">
<h6 id="org5632d8f">mingw-w64 port for native Windows OCaml 5</h6>
<div class="outline-text-6" id="text-org5632d8f">
<p>
I did the original port of multicore OCaml way back in 2018 (see <a href="https://discuss.ocaml.org/t/multicore-ocaml-on-windows/1844">Discuss
post</a>); that got rebased to 4.10 and updated to include
native code support during summer 2020, but the testing story wasn't quite there. However, it got updated in the
autumn and was merged just-in-time for the main PR to ocaml/ocaml! At the moment, we only support the mingw-w64 port
on Windows: OCaml 4.x has a hand-crafted implementation of all the required pthreads primitives in the systhreads
library, but for 5.x we're, at least for now, using the winpthreads library from the mingw-w64 project.
</p>

<p>
In the meantime, the Cygwin64 port is mostly broken for slightly complicated reasons and the MSVC port isn't working
from a combination of a lack of C11 atomics support and the aforementioned winpthreads library which is in mingw-w64.
It's extremely unlikely that the MSVC port will be ready for OCaml 5.0, but I have got a version of it just about
working using C++ atomics and a manual build of the winpthreads library using Visual Studio, so there is light at the
end of the tunnel for the MSVC port, hopefully for OCaml 5.1!
</p>
</div>
</div>

<div id="outline-container-orga29c118" class="outline-6">
<h6 id="orga29c118">FlexDLL updates for Visual Studio</h6>
<div class="outline-text-6" id="text-orga29c118">
<p>
Recent changes in the Windows SDK required some alterations in the <code>flexlink</code> linker, used in both the native Windows
ports and the Cygwin port of OCaml. This project got a little bit of merging attention and a release, so recent
updates of Visual Studio 2017 and 2019 and also Visual Studio 2022 now successfully build OCaml 4.x, even with the
Windows 11 SDK.
</p>
</div>
</div>

<div id="outline-container-org935c7a0" class="outline-6">
<h6 id="org935c7a0">Native toplevel library in 4.14</h6>
<div class="outline-text-6" id="text-org935c7a0">
<p>
I helped to upstream some work done by others, and also narrowed the differences between <code>ocaml</code> and <code>ocamlnat</code> for
4.14. In OCaml 4.14, the native toplevel <span class="underline">library</span> is now always installed, which paves the way for native code
programs which wish to interpret toplevel statements (e.g. a native version of the <code>mdx</code> tool). Part of this work
also inserted some hooks into the toplevel which allow the external linker to be replaced with a dynamic code emitter
(so-called "ocaml-jit", but the use of <span class="underline">JIT</span> seems to cause a lot of confusion - the point is that the overhead of
repeatedly calling an external assembler is removed, which is measurable when compiling lots of individual phrases).
</p>
</div>
</div>
