2022.03.08.txt


@nojb Nicolas Ojeda Bär
┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄

  We are taking advantage of the 5.0 release to get rid of a lot of
  cruft that had built up over time:
  • #[10897]: Remove everything officially marked as deprecated before
     the 5.0 release.
  • #[10863]: Remove the `<caml/compatibiliy.h>' header which contained
     the definition of some runtime symbols without the `caml_' prefix
     for compatibility.
  • #[10896]: Remove `Stream', `Genlex' and `Pervasives' from the
     standard library, as well as the *standalone* `bigarray' library
     (no longer needed since the `Bigarray' module was moved into the
     standard library).
  • #[11002]: No longer use the `Begin_roots~/~End_roots' macros in the
     runtime system. These were not yet removed because they are used by
     some external projects (eg [`camlidl']).
  • #[10922], #[10923]: Add deprecation attributes to some symbols that
     did not have them so that we can remove them in some future
     release.

  Apart from all this spring cleaning, a small addition to the standard
  library that I had missed for a long time:

  • #[10986]: Add `Scanf.scanf_opt', `Scanf.sscanf_opt' and
     `Scanf.bscanf_opt' option-returning variants.


[10897] <https://github.com/ocaml/ocaml/issues/10897>

[10863] <https://github.com/ocaml/ocaml/issues/10863>

[10896] <https://github.com/ocaml/ocaml/issues/10896>

[11002] <https://github.com/ocaml/ocaml/issues/11002>

[`camlidl'] <https://github.com/xavierleroy/camlidl>

[10922] <https://github.com/ocaml/ocaml/issues/10922>

[10923] <https://github.com/ocaml/ocaml/issues/10923>

[10986] <https://github.com/ocaml/ocaml/issues/10986>


@dra27 David Allsopp
┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄

mingw-w64 port for native Windows OCaml 5
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈

  I did the original port of multicore OCaml way back in 2018 (see
  [Discuss post]); that got rebased to 4.10 and updated to include
  native code support during summer 2020, but the testing story wasn't
  quite there. However, it got updated in the autumn and was merged
  just-in-time for the main PR to ocaml/ocaml! At the moment, we only
  support the mingw-w64 port on Windows: OCaml 4.x has a hand-crafted
  implementation of all the required pthreads primitives in the
  systhreads library, but for 5.x we're, at least for now, using the
  winpthreads library from the mingw-w64 project.

  In the meantime, the Cygwin64 port is mostly broken for slightly
  complicated reasons and the MSVC port isn't working from a combination
  of a lack of C11 atomics support and the aforementioned winpthreads
  library which is in mingw-w64.  It's extremely unlikely that the MSVC
  port will be ready for OCaml 5.0, but I have got a version of it just
  about working using C++ atomics and a manual build of the winpthreads
  library using Visual Studio, so there is light at the end of the
  tunnel for the MSVC port, hopefully for OCaml 5.1!


[Discuss post]
<https://discuss.ocaml.org/t/multicore-ocaml-on-windows/1844>


FlexDLL updates for Visual Studio
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈

  Recent changes in the Windows SDK required some alterations in the
  `flexlink' linker, used in both the native Windows ports and the
  Cygwin port of OCaml. This project got a little bit of merging
  attention and a release, so recent updates of Visual Studio 2017 and
  2019 and also Visual Studio 2022 now successfully build OCaml 4.x,
  even with the Windows 11 SDK.


Native toplevel library in 4.14
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈

  I helped to upstream some work done by others, and also narrowed the
  differences between `ocaml' and `ocamlnat' for 4.14. In OCaml 4.14,
  the native toplevel _library_ is now always installed, which paves the
  way for native code programs which wish to interpret toplevel
  statements (e.g. a native version of the `mdx' tool). Part of this
  work also inserted some hooks into the toplevel which allow the
  external linker to be replaced with a dynamic code emitter (so-called
  "ocaml-jit", but the use of _JIT_ seems to cause a lot of confusion -
  the point is that the overhead of repeatedly calling an external
  assembler is removed, which is measurable when compiling lots of
  individual phrases).
