2022.03.08.html

<div id="outline-container-orgc294150" class="outline-6">
<h6 id="orgc294150">glibc 2.34 back-ports</h6>
<div class="outline-text-6" id="text-orgc294150">
<p>
glibc 2.34 includes a change to the way alternate stacks for the signal handlers must be allocated. The issue was
partially fixed in 4.13, but as newer distributions started to ship with this newer glibc, the change in behaviour
for older OCaml versions was becoming problematic - for example, you couldn't install OCaml 4.12 or earlier on the
latest release of Ubuntu or Fedora. Xavier worked on the second half of the fix already in 4.13 (to deallocate the
alternate stack on termination), and I managed the process of back-porting it to all the versions of OCaml in
opam-repository (3.07+!). We also took the decision to push these patches to the old release branches on GitHub,
partly as a convenient place to store them, since opam-repository references them from there, and partly as it allows
the older branches still to be compiled directly from a git clone.
</p>
</div>
</div>
</div>
</div>
</div>
</div>




<div id="outline-container-12" class="outline-2">
<h2 id="12">HACL* in OCaml: safe bindings for verified C code using Ctypes</h2>
<div class="outline-text-2" id="text-12">
<p>
Archive: <a href="https://discuss.ocaml.org/t/hacl-in-ocaml-safe-bindings-for-verified-c-code-using-ctypes/9470/1">https://discuss.ocaml.org/t/hacl-in-ocaml-safe-bindings-for-verified-c-code-using-ctypes/9470/1</a>
</p>
</div>

<div id="outline-container-org8617b82" class="outline-3">
<h3 id="org8617b82">Victor Dumitrescu announced</h3>
<div class="outline-text-3" id="text-org8617b82">
<p>
I wanted to share a <a href="https://research-development.nomadic-labs.com/improving-the-implementation-of-cryptography-in-tezos-octez.html">blog
post</a>
that we wrote a while back at Nomadic Labs. I thought this might be interesting to folks here, particularly the more
in-depth discussion on how we use Ctypes to safely interface with the formally verified C code of the HACL*
cryptography library in OCaml and on the design of our high-level API.
</p>
</div>
</div>
</div>




<div id="outline-container-13" class="outline-2">
<h2 id="13">OUPS meetup march 2022 (french only)</h2>
<div class="outline-text-2" id="text-13">
<p>
Archive: <a href="https://discuss.ocaml.org/t/oups-meetup-march-2022-french-only/9471/1">https://discuss.ocaml.org/t/oups-meetup-march-2022-french-only/9471/1</a>
</p>
</div>

<div id="outline-container-org20bf8dd" class="outline-3">
<h3 id="org20bf8dd">zapashcanon announced</h3>
<div class="outline-text-3" id="text-org20bf8dd">
<p>
(this is in french only as the talks will be in french it’s probably not relevant for english speakers)
</p>

<p>
Le prochain OUPS aura lieu le <b>jeudi 10 mars</b> 2022. Le rendez-vous est fixé à <b>18h30</b> en <b>salle 15-16 101</b> .
</p>

<p>
Ce meetup aura lieu dans les locaux de l'<a href="https://www.irill.org">IRILL</a> au <a href="https://www.openstreetmap.org/#map=19/48.84650/2.35457">4 place Jussieu, 75005 Paris</a> en <b>salle 101</b> . Pour accéder à
la salle, il faut aller à la colonne 15 ou 16, monter un étage et accéder au couloir 15-16. Voir les <a href="https://www.irill.org/pages/access.html">instructions
d'accès</a>.
</p>

<p>
<b>L'inscription est obligatoire</b> pour pouvoir accéder au meetup ! Votre nom complet doit être disponible. Merci de
vous <a href="https://www.meetup.com/fr-FR/ocaml-paris">inscrire</a> <b>le mercredi 9 mars</b> au plus tard.
</p>

<p>
Le meetup consistera en deux exposés à la suite de quoi, les traditionnels pot et pizza party ne pouvant avoir lieux
à l'IRILL, nous proposerons à ceux qui le souhaitent de se rendre au <a href="https://www.openstreetmap.org/node/2298160176">Baker Street Pub</a> pour prolonger les
discussions. Le passe sanitaire sera demandé pour participer à cette partie de l'évènement.
</p>

<p>
Le programme des exposés de cette édition est donné ci-dessous et nous profitons de l'occasion pour rappeler que nous
sommes toujours à la recherche de <i>propositions</i> d'exposés pour les meetups suivants. Si vous souhaitez proposer un
exposé, contactez-nous sur le <a href="https://oups.zulipchat.com">zulip OUPS</a>.
</p>
</div>

<div id="outline-container-orgcc78de9" class="outline-4">
<h4 id="orgcc78de9">Interfacing OCaml with Sundials for numerical simulation, par Timothy Bourke</h4>
<div class="outline-text-4" id="text-orgcc78de9">
<p>
Sundials/ML is an OCaml interface to (most of) the Sundials suite of numerical solvers. It provides access to the
underlying C library and exploits features of the OCaml type and module systems to document and ensure its correct
utilisation. We reimplemented a hundred-odd of the examples provided with Sundials to aid in developing, debugging,
and benchmarking the OCaml library. The standard examples, iterated hundreds or thousands of times, are rarely twice
as slow in OCaml as in C and usually less than 50% slower. We also found many bugs in our code (and a few in Sundials
itself) by executing these examples with valgrind.
</p>

<p>
<a href="https://github.com/inria-parkas/sundialsml">https://github.com/inria-parkas/sundialsml</a>
</p>
</div>
</div>

<div id="outline-container-orgab3308e" class="outline-4">
<h4 id="orgab3308e">Epidemiological inference in OCaml, par Benjamin Nguyen</h4>
<div class="outline-text-4" id="text-orgab3308e">
<p>
OCaml is a great choice for simulating mathematical models: Its functional nature and its type and module system
allow to easily express mathematical models and to simulate them in a modular and (reasonably) efficient manner.
I will share some of the code and results from my PhD about the Bayesian inference of infectious diseases, with
simulation of stochastic processes, MCMC, phylogenetic inference, and musical populations.
</p>

<p>
<a href="https://gitlab.com/bnguyenvanyen/ocamlecoevo">https://gitlab.com/bnguyenvanyen/ocamlecoevo</a>
</p>
</div>
</div>
</div>
</div>
