2022.03.08.txt


glibc 2.34 back-ports
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈

  glibc 2.34 includes a change to the way alternate stacks for the
  signal handlers must be allocated. The issue was partially fixed in
  4.13, but as newer distributions started to ship with this newer
  glibc, the change in behaviour for older OCaml versions was becoming
  problematic - for example, you couldn't install OCaml 4.12 or earlier
  on the latest release of Ubuntu or Fedora. Xavier worked on the second
  half of the fix already in 4.13 (to deallocate the alternate stack on
  termination), and I managed the process of back-porting it to all the
  versions of OCaml in opam-repository (3.07+!). We also took the
  decision to push these patches to the old release branches on GitHub,
  partly as a convenient place to store them, since opam-repository
  references them from there, and partly as it allows the older branches
  still to be compiled directly from a git clone.


HACL* in OCaml: safe bindings for verified C code using Ctypes
══════════════════════════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/hacl-in-ocaml-safe-bindings-for-verified-c-code-using-ctypes/9470/1>


Victor Dumitrescu announced
───────────────────────────

  I wanted to share a [blog post] that we wrote a while back at Nomadic
  Labs. I thought this might be interesting to folks here, particularly
  the more in-depth discussion on how we use Ctypes to safely interface
  with the formally verified C code of the HACL* cryptography library in
  OCaml and on the design of our high-level API.


[blog post]
<https://research-development.nomadic-labs.com/improving-the-implementation-of-cryptography-in-tezos-octez.html>


OUPS meetup march 2022 (french only)
════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/oups-meetup-march-2022-french-only/9471/1>


zapashcanon announced
─────────────────────

  (this is in french only as the talks will be in french it’s probably
  not relevant for english speakers)

  Le prochain OUPS aura lieu le *jeudi 10 mars* 2022. Le rendez-vous est
  fixé à *18h30* en *salle 15-16 101* .

  Ce meetup aura lieu dans les locaux de l'[IRILL] au [4 place Jussieu,
  75005 Paris] en *salle 101* . Pour accéder à la salle, il faut aller à
  la colonne 15 ou 16, monter un étage et accéder au couloir 15-16. Voir
  les [instructions d'accès].

  *L'inscription est obligatoire* pour pouvoir accéder au meetup ! Votre
  nom complet doit être disponible. Merci de vous [inscrire] *le
  mercredi 9 mars* au plus tard.

  Le meetup consistera en deux exposés à la suite de quoi, les
  traditionnels pot et pizza party ne pouvant avoir lieux à l'IRILL,
  nous proposerons à ceux qui le souhaitent de se rendre au [Baker
  Street Pub] pour prolonger les discussions. Le passe sanitaire sera
  demandé pour participer à cette partie de l'évènement.

  Le programme des exposés de cette édition est donné ci-dessous et nous
  profitons de l'occasion pour rappeler que nous sommes toujours à la
  recherche de /propositions/ d'exposés pour les meetups suivants. Si
  vous souhaitez proposer un exposé, contactez-nous sur le [zulip OUPS].


[IRILL] <https://www.irill.org>

[4 place Jussieu, 75005 Paris]
<https://www.openstreetmap.org/#map=19/48.84650/2.35457>

[instructions d'accès] <https://www.irill.org/pages/access.html>

[inscrire] <https://www.meetup.com/fr-FR/ocaml-paris>

[Baker Street Pub] <https://www.openstreetmap.org/node/2298160176>

[zulip OUPS] <https://oups.zulipchat.com>

Interfacing OCaml with Sundials for numerical simulation, par Timothy Bourke
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  Sundials/ML is an OCaml interface to (most of) the Sundials suite of
  numerical solvers. It provides access to the underlying C library and
  exploits features of the OCaml type and module systems to document and
  ensure its correct utilisation. We reimplemented a hundred-odd of the
  examples provided with Sundials to aid in developing, debugging, and
  benchmarking the OCaml library. The standard examples, iterated
  hundreds or thousands of times, are rarely twice as slow in OCaml as
  in C and usually less than 50% slower. We also found many bugs in our
  code (and a few in Sundials itself) by executing these examples with
  valgrind.

  <https://github.com/inria-parkas/sundialsml>


Epidemiological inference in OCaml, par Benjamin Nguyen
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  OCaml is a great choice for simulating mathematical models: Its
  functional nature and its type and module system allow to easily
  express mathematical models and to simulate them in a modular and
  (reasonably) efficient manner.  I will share some of the code and
  results from my PhD about the Bayesian inference of infectious
  diseases, with simulation of stochastic processes, MCMC, phylogenetic
  inference, and musical populations.

  <https://gitlab.com/bnguyenvanyen/ocamlecoevo>
