2022.03.08.org
* VSCode OCaml Platform 1.10.0
:PROPERTIES:
:CUSTOM_ID: 14
:END:
Archive: https://discuss.ocaml.org/t/ann-vscode-ocaml-platform-1-10-0/9481/1

** Max Lantas announced


We are happy to announce the 1.10.0 release of [[https://github.com/ocamllabs/vscode-ocaml-platform][VSCode OCaml
Platform]], a Visual Studio Code extension for OCaml. It is now
available on the [[https://marketplace.visualstudio.com/items?itemName=ocamllabs.ocaml-platform][VSCode Marketplace]].

This release adds an offline opam package documentation generation and viewing feature by
[[https://github.com/tatchi][@tatchi]]. It is available by clicking the icon of a opam package in the OCaml sidebar.

Please feel free to share feedback.

*** Change Log

**** 1.10.0

- Add the possibility to generate and show the documentation of an installed
  package right into VSCode. ([[https://github.com/ocamllabs/vscode-ocaml-platform/pull/771][#771]])
      



* Other OCaml News
:PROPERTIES:
:CUSTOM_ID: 15
:END:
** From the ocamlcore planet blog


Here are links from many OCaml blogs aggregated at [[http://ocaml.org/community/planet/][OCaml Planet]].

- [[https://tarides.com/blog/2022-03-01-segfault-systems-joins-tarides][Segfault Systems Joins Tarides]]
- [[http://ocaml-book.com/blog/2022/2/18/ocaml-from-the-very-beginning-now-free-in-html-and-pdf-formats][OCaml from the Very Beginning now free in HTML and PDF formats]]
- [[http://frama-c.com/jobs/2022-02-01-permanent-computer-scientist-cyber-security-verification.html][Permanent Computer Scientist Position at CEA LIST - LSL]]
- [[https://tarides.com/blog/2022-01-27-ocaml-labs-joins-tarides][OCaml Labs Joins Tarides]]
- [[https://blog.janestreet.com/project-pairing/][How Jane Street Pairs Interns to Projects and Teams During the Software Engineering Internship]]
- [[http://math.andrej.com/2022/01/12/projective-setoids/][Is every projective setoid isomorphic to a type?]]
- [[http://math.andrej.com/2022/01/12/two-new-doctors/][Two new doctors!]]
- [[https://blog.janestreet.com/magic-trace/][Magic-trace: Diagnosing tricky performance issues easily with Intel Processor Trace]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
