2022.03.08.html




<div id="outline-container-14" class="outline-2">
<h2 id="14">VSCode OCaml Platform 1.10.0</h2>
<div class="outline-text-2" id="text-14">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-vscode-ocaml-platform-1-10-0/9481/1">https://discuss.ocaml.org/t/ann-vscode-ocaml-platform-1-10-0/9481/1</a>
</p>
</div>

<div id="outline-container-org22b1c92" class="outline-3">
<h3 id="org22b1c92">Max Lantas announced</h3>
<div class="outline-text-3" id="text-org22b1c92">
<p>
We are happy to announce the 1.10.0 release of <a href="https://github.com/ocamllabs/vscode-ocaml-platform">VSCode OCaml
Platform</a>, a Visual Studio Code extension for OCaml. It is now
available on the <a href="https://marketplace.visualstudio.com/items?itemName=ocamllabs.ocaml-platform">VSCode Marketplace</a>.
</p>

<p>
This release adds an offline opam package documentation generation and viewing feature by
<a href="https://github.com/tatchi">@tatchi</a>. It is available by clicking the icon of a opam package in the OCaml sidebar.
</p>

<p>
Please feel free to share feedback.
</p>
</div>

<div id="outline-container-org6808199" class="outline-4">
<h4 id="org6808199">Change Log</h4>
<div class="outline-text-4" id="text-org6808199">
</div>
<div id="outline-container-orgef64968" class="outline-5">
<h5 id="orgef64968">1.10.0</h5>
<div class="outline-text-5" id="text-orgef64968">
<ul class="org-ul">
<li>Add the possibility to generate and show the documentation of an installed
package right into VSCode. (<a href="https://github.com/ocamllabs/vscode-ocaml-platform/pull/771">#771</a>)</li>
</ul>
</div>
</div>
</div>
</div>
</div>




<div id="outline-container-15" class="outline-2">
<h2 id="15">Other OCaml News</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org40b7b9e" class="outline-3">
<h3 id="org40b7b9e">From the ocamlcore planet blog</h3>
<div class="outline-text-3" id="text-org40b7b9e">
<p>
Here are links from many OCaml blogs aggregated at <a href="http://ocaml.org/community/planet/">OCaml Planet</a>.
</p>

<ul class="org-ul">
<li><a href="https://tarides.com/blog/2022-03-01-segfault-systems-joins-tarides">Segfault Systems Joins Tarides</a></li>
<li><a href="http://ocaml-book.com/blog/2022/2/18/ocaml-from-the-very-beginning-now-free-in-html-and-pdf-formats">OCaml from the Very Beginning now free in HTML and PDF formats</a></li>
<li><a href="http://frama-c.com/jobs/2022-02-01-permanent-computer-scientist-cyber-security-verification.html">Permanent Computer Scientist Position at CEA LIST - LSL</a></li>
<li><a href="https://tarides.com/blog/2022-01-27-ocaml-labs-joins-tarides">OCaml Labs Joins Tarides</a></li>
<li><a href="https://blog.janestreet.com/project-pairing/">How Jane Street Pairs Interns to Projects and Teams During the Software Engineering Internship</a></li>
<li><a href="http://math.andrej.com/2022/01/12/projective-setoids/">Is every projective setoid isomorphic to a type?</a></li>
<li><a href="http://math.andrej.com/2022/01/12/two-new-doctors/">Two new doctors!</a></li>
<li><a href="https://blog.janestreet.com/magic-trace/">Magic-trace: Diagnosing tricky performance issues easily with Intel Processor Trace</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orge5d7f12" class="outline-2">
<h2 id="orge5d7f12">Old CWN</h2>
<div class="outline-text-2" id="text-orge5d7f12">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="org65f64f2">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
