2022.03.08.txt


VSCode OCaml Platform 1.10.0
════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ann-vscode-ocaml-platform-1-10-0/9481/1>


Max Lantas announced
────────────────────

  We are happy to announce the 1.10.0 release of [VSCode OCaml
  Platform], a Visual Studio Code extension for OCaml. It is now
  available on the [VSCode Marketplace].

  This release adds an offline opam package documentation generation and
  viewing feature by [@tatchi]. It is available by clicking the icon of
  a opam package in the OCaml sidebar.

  Please feel free to share feedback.


[VSCode OCaml Platform]
<https://github.com/ocamllabs/vscode-ocaml-platform>

[VSCode Marketplace]
<https://marketplace.visualstudio.com/items?itemName=ocamllabs.ocaml-platform>

[@tatchi] <https://github.com/tatchi>

Change Log
╌╌╌╌╌╌╌╌╌╌

1.10.0
┄┄┄┄┄┄

  • Add the possibility to generate and show the documentation of an
    installed package right into VSCode. ([#771])


[#771] <https://github.com/ocamllabs/vscode-ocaml-platform/pull/771>


Other OCaml News
════════════════

From the ocamlcore planet blog
──────────────────────────────

  Here are links from many OCaml blogs aggregated at [OCaml Planet].

  • [Segfault Systems Joins Tarides]
  • [OCaml from the Very Beginning now free in HTML and PDF formats]
  • [Permanent Computer Scientist Position at CEA LIST - LSL]
  • [OCaml Labs Joins Tarides]
  • [How Jane Street Pairs Interns to Projects and Teams During the
    Software Engineering Internship]
  • [Is every projective setoid isomorphic to a type?]
  • [Two new doctors!]
  • [Magic-trace: Diagnosing tricky performance issues easily with Intel
    Processor Trace]


[OCaml Planet] <http://ocaml.org/community/planet/>

[Segfault Systems Joins Tarides]
<https://tarides.com/blog/2022-03-01-segfault-systems-joins-tarides>

[OCaml from the Very Beginning now free in HTML and PDF formats]
<http://ocaml-book.com/blog/2022/2/18/ocaml-from-the-very-beginning-now-free-in-html-and-pdf-formats>

[Permanent Computer Scientist Position at CEA LIST - LSL]
<http://frama-c.com/jobs/2022-02-01-permanent-computer-scientist-cyber-security-verification.html>

[OCaml Labs Joins Tarides]
<https://tarides.com/blog/2022-01-27-ocaml-labs-joins-tarides>

[How Jane Street Pairs Interns to Projects and Teams During the Software
Engineering Internship] <https://blog.janestreet.com/project-pairing/>

[Is every projective setoid isomorphic to a type?]
<http://math.andrej.com/2022/01/12/projective-setoids/>

[Two new doctors!] <http://math.andrej.com/2022/01/12/two-new-doctors/>

[Magic-trace: Diagnosing tricky performance issues easily with Intel
Processor Trace] <https://blog.janestreet.com/magic-trace/>


Old CWN
═══════

  If you happen to miss a CWN, you can [send me a message] and I'll mail
  it to you, or go take a look at [the archive] or the [RSS feed of the
  archives].

  If you also wish to receive it every week by mail, you may subscribe
  [online].

  [Alan Schmitt]


[send me a message] <mailto:alan.schmitt@polytechnique.org>

[the archive] <https://alan.petitepomme.net/cwn/>

[RSS feed of the archives] <https://alan.petitepomme.net/cwn/cwn.rss>

[online] <http://lists.idyll.org/listinfo/caml-news-weekly/>

[Alan Schmitt] <https://alan.petitepomme.net/>
